RT-Thread/rt-thread/bsp/gd32103c-eval/Libraries/GD32F1xx_standard_peripheral/Source/gd32f10x_eth.c
    /* PHY reset need some time */
    _eth_delay_(PHY_RESETDELAY);

    if (ETH_InitParaStruct->ETH_MAC_AutoNegotiation != ETH_AUTONEGOTIATION_DISABLE) {
        /* Wait for PHY_LINKED_STATUS bit be set */
        do {
            timeout++;
        } while (!(ETH_GetPHYRegisterValue(PHYAddress, PHY_BSR) & PHY_LINKED_STATUS) && (timeout < PHY_READ_TO));
        /* Return ERROR due to timeout */
        if (timeout == PHY_READ_TO) {
            return ERROR;
        }
        /* Reset Timeout counter */
        timeout = 0;

        /* Enable Auto-Negotiation */
        if (!(ETH_SetPHYRegisterValue(PHYAddress, PHY_BCR, PHY_AUTONEGOTIATION))) {
            /* Return ERROR due to write timeout */
            return ERROR;
        }

        /* Wait for the PHY_AUTONEGO_COMPLETE bit be set */
        do {
            timeout++;
        } while (!(ETH_GetPHYRegisterValue(PHYAddress, PHY_BSR) & PHY_AUTONEGO_COMPLETE) && (timeout < (uint32_t)PHY_READ_TO));
        /* Return ERROR due to timeout */
        if (timeout == PHY_READ_TO) {
            return ERROR;
        }
        /* Reset Timeout counter */
        timeout = 0;

        /* Read the result of the autonegotiation */
        RegValue = ETH_GetPHYRegisterValue(PHYAddress, PHY_SR);

        /* Configure the Duplex Mode of MAC following the autonegotiation result */
        if ((RegValue & PHY_DUPLEX_STATUS) != (uint32_t)RESET) {
            ETH_InitParaStruct->ETH_MAC_Mode = ETH_MODE_FULLDUPLEX;

        } else {
            ETH_InitParaStruct->ETH_MAC_Mode = ETH_MODE_HALFDUPLEX;
        }
        /* Configure the Communication speed of MAC following the autonegotiation result */
        if (RegValue & PHY_Speed_Status) {
            ETH_InitParaStruct->ETH_MAC_Speed = ETH_SPEEDMODE_10M;
        } else {
            ETH_InitParaStruct->ETH_MAC_Speed = ETH_SPEEDMODE_100M;
        }
    } else {
        if (!ETH_SetPHYRegisterValue(PHYAddress, PHY_BCR, ((uint16_t)(ETH_InitParaStruct->ETH_MAC_Mode >> 3) |
                                     (uint16_t)(ETH_InitParaStruct->ETH_MAC_Speed >> 1)))) {
            /* Return ERROR due to write timeout */
            return ERROR;
        }
        /* PHY configuration need some time */
        _eth_delay_(PHY_CONFIGDELAY);
    }
    /* ETH_MAC_CFR Configuration */
    /* Get the ETH_MAC_CFR value */
    temp = ETH_MAC->CFR;
    temp &= MAC_CFR_CLEAR_MASK;
    /* Set the WDD bit according to ETH_MAC_Watchdog value */
    /* Set the JBD: bit according to ETH_MAC_Jabber value */
    /* Set the IG bit according to ETH_MAC_InterFrameGap value */
    /* Set the CSD bit according to ETH_MAC_CarrierSense value */
    /* Set the SPD bit according to ETH_MAC_Speed value */
    /* Set the ROD bit according to ETH_MAC_ReceiveOwn value */
    /* Set the LBM bit according to ETH_MAC_LoopbackMode value */
    /* Set the DPM bit according to ETH_MAC_Mode value */
    /* Set the IP4CO bit according to ETH_MAC_ChecksumOffload value */
    /* Set the RTD bit according to ETH_MAC_RetryTransmission value */
    /* Set the APCD bit according to ETH_MAC_AutomaticPadCRCDrop value */
    /* Set the BOL bit according to ETH_MAC_BackOffLimit value */
    /* Set the DFC bit according to ETH_MAC_DeferralCheck value */
    temp |= (uint32_t)(ETH_InitParaStruct->ETH_MAC_Watchdog |
                       ETH_InitParaStruct->ETH_MAC_Jabber |
                       ETH_InitParaStruct->ETH_MAC_InterFrameGap |
                       ETH_InitParaStruct->ETH_MAC_CarrierSense |
                       ETH_InitParaStruct->ETH_MAC_Speed |
                       ETH_InitParaStruct->ETH_MAC_ReceiveOwn |
                       ETH_InitParaStruct->ETH_MAC_LoopbackMode |
                       ETH_InitParaStruct->ETH_MAC_Mode |
                       ETH_InitParaStruct->ETH_MAC_ChecksumOffload |
                       ETH_InitParaStruct->ETH_MAC_RetryTransmission |
                       ETH_InitParaStruct->ETH_MAC_AutomaticPadCRCDrop |
                       ETH_InitParaStruct->ETH_MAC_BackOffLimit |
                       ETH_InitParaStruct->ETH_MAC_DeferralCheck);
    /* Write to ETH_MAC_CFR */
    ETH_MAC->CFR = (uint32_t)temp;

    /* ETH_MAC_FRMFR Configuration */
    /* Set the FD bit according to ETH_MAC_FilterDisable value */
    /* Set the SAFLT and SAIFLT bits according to ETH_MAC_SourceAddrFilter value */
    /* Set the PCFRM bit according to ETH_MAC_PassControlFrames value */
    /* Set the DBF bit according to ETH_MAC_BroadcastFramesReception value */
    /* Set the DAIFLT bit according to ETH_MAC_DestinationAddrFilter value */
    /* Set the PM bit according to ETH_MAC_PromiscuousMode value */
    /* Set the PM, HMF and HPFLT bits according to ETH_MAC_MulticastFramesFilter value */
    /* Set the HUF and HPFLT bits according to ETH_MAC_UnicastFramesFilter value */
    /* Write to ETH_MAC_FRMFR */
    ETH_MAC->FRMFR = (uint32_t)(ETH_InitParaStruct->ETH_MAC_FilterDisable |
                                ETH_InitParaStruct->ETH_MAC_SourceAddrFilter |
                                ETH_InitParaStruct->ETH_MAC_PassControlFrames |
                                ETH_InitParaStruct->ETH_MAC_BroadcastFramesReception |
                                ETH_InitParaStruct->ETH_MAC_DestinationAddrFilter |
                                ETH_InitParaStruct->ETH_MAC_PromiscuousMode |
                                ETH_InitParaStruct->ETH_MAC_MulticastFramesFilter |
                                ETH_InitParaStruct->ETH_MAC_UnicastFramesFilter);
    /* ETH_MAC_HLHR and MAC_HLLR Configuration */
    /* Write to ETHERNET MAC_HLHR */
    ETH_MAC->HLHR = (uint32_t)ETH_InitParaStruct->ETH_MAC_HashListHigh;
    /* Write to ETHERNET MAC_HLLR */
    ETH_MAC->HLLR = (uint32_t)ETH_InitParaStruct->ETH_MAC_HashListLow;
    /* ETH_MAC_FCTLR Configuration */
    /* Get the ETH_MAC_FCTLR value */
    temp = ETH_MAC->FCTLR;
    temp &= MAC_FCTLR_CLEAR_MASK;

    /* Set the PTM bit according to ETH_MAC_PauseTime value */
    /* Set the ZQPD bit according to ETH_MAC_ZeroQuantaPause value */
    /* Set the PLTS bit according to ETH_MAC_PauseLowThreshold value */
    /* Set the UPFDT bit according to  ETH_MAC_UnicastPauseFrameDetect value */
    /* Set the RFCEN bit according to ETH_MAC_ReceiveFlowControl value */
    /* Set the TFCEN bit according to ETH_MAC_TransmitFlowControl value */
    temp |= (uint32_t)((ETH_InitParaStruct->ETH_MAC_PauseTime << 16) |
                       ETH_InitParaStruct->ETH_MAC_ZeroQuantaPause |
                       ETH_InitParaStruct->ETH_MAC_PauseLowThreshold |
                       ETH_InitParaStruct->ETH_MAC_UnicastPauseFrameDetect |
                       ETH_InitParaStruct->ETH_MAC_ReceiveFlowControl |
                       ETH_InitParaStruct->ETH_MAC_TransmitFlowControl);
    /* Write to ETH_MAC_FCTLR */
    ETH_MAC->FCTLR = (uint32_t)temp;
    /* ETH_MAC_FCTHR Configuration */
    temp = ETH_MAC->FCTHR;
    temp |= (uint32_t)(ETH_InitParaStruct->ETH_MAC_FlowControlDeactiveThreshold |
                       ETH_InitParaStruct->ETH_MAC_FlowControlActiveThreshold);
    ETH_MAC->FCTHR = (uint32_t)temp;
    /* ETH_MAC_VLTR Configuration */
    /* Set the VLTC bit according to ETH_MAC_VLANTagComparison value */
    /* Set the VLTI bit according to ETH_MAC_VLANTagIdentifier value */
    ETH_MAC->VLTR = (uint32_t)(ETH_InitParaStruct->ETH_MAC_VLANTagComparison |
                               ETH_InitParaStruct->ETH_MAC_VLANTagIdentifier);

    /* DMA Config */
    /* ETH_DMA_CTLR Configuration */
    /* Get the ETHERNET DMA_CTLR value */
    temp = ETH_DMA->CTLR;
    temp &= DMA_CTLR_CLEAR_MASK;

    /* Set the DTCERFD bit according to ETH_DMA_DropTCPIPChecksumErrorFrame value */
    /* Set the RSFD bit according to ETH_DMA_ReceiveStoreForward value */
    /* Set the DAFRF bit according to ETH_DMA_FlushReceivedFrame value */
    /* Set the TSFD bit according to ETH_DMA_TransmitStoreForward value */
    /* Set the TTCH bit according to ETH_DMA_TransmitThresholdControl value */
    /* Set the FERF bit according to ETH_DMA_ForwardErrorFrames value */
    /* Set the FUF bit according to ETH_DMA_ForwardUndersizedGoodFrames value */
    /* Set the RTHC bit according to ETH_DMA_ReceiveThresholdControl value */
    /* Set the OSF bit according to ETH_DMA_SecondFrameOperate value */
    temp |= (uint32_t)(ETH_InitParaStruct->ETH_DMA_DropTCPIPChecksumErrorFrame |
                       ETH_InitParaStruct->ETH_DMA_ReceiveStoreForward |
                       ETH_InitParaStruct->ETH_DMA_FlushReceivedFrame |
                       ETH_InitParaStruct->ETH_DMA_TransmitStoreForward |
                       ETH_InitParaStruct->ETH_DMA_TransmitThresholdControl |
                       ETH_InitParaStruct->ETH_DMA_ForwardErrorFrames |
                       ETH_InitParaStruct->ETH_DMA_ForwardUndersizedGoodFrames |
                       ETH_InitParaStruct->ETH_DMA_ReceiveThresholdControl |
                       ETH_InitParaStruct->ETH_DMA_SecondFrameOperate);
    /* Write to ETH_DMA_CTLR */
    ETH_DMA->CTLR = (uint32_t)temp;

    /* ETH_DMA_BCR Configuration */
    /* Set the AA bit according to ETH_DMA_AddressAligned value */
    /* Set the FB bit according to ETH_DMA_FixedBurst value */
    /* Set the RXDP and 4*PBL bits according to ETH_DMA_RxDMABurstLength value */
    /* Set the FPBL and 4*PBL bits according to ETH_DMA_TxDMABurstLength value */
    /* Set the DPSL bit according to ETH_DesciptorSkipLength value */
    /* Set the RTPR and DAB bits according to ETH_DMA_Arbitration value */
    ETH_DMA->BCR = (uint32_t)(ETH_InitParaStruct->ETH_DMA_AddressAligned |
                              ETH_InitParaStruct->ETH_DMA_FixedBurst |
                              ETH_InitParaStruct->ETH_DMA_RxDMABurstLength | /* If 4xPBL is selected for Tx or Rx it is applied for the other */
                              ETH_InitParaStruct->ETH_DMA_TxDMABurstLength |
                              (ETH_InitParaStruct->ETH_DMA_DescriptorSkipLength << 2) |
                              ETH_InitParaStruct->ETH_DMA_Arbitration |
                              ETH_DMA_BCR_UIP); /* Enable use of separate PBL for Rx and Tx */
    /* Return Ethernet configuration success */
    return SUCCESS;
}

/**
  * @brief  Initial the sturct ETH_InitPara.
  * @param  ETH_InitParaStruct: pointer to a ETH_InitPara structure.
  * @retval None
  */
void ETH_ParaInit(ETH_InitPara *ETH_InitParaStruct)
{
    /* Reset ETH init structure parameters values */
    /* MAC */
    ETH_InitParaStruct->ETH_MAC_AutoNegotiation = ETH_AUTONEGOTIATION_DISABLE;
    ETH_InitParaStruct->ETH_MAC_Watchdog = ETH_WATCHDOG_ENABLE;
    ETH_InitParaStruct->ETH_MAC_Jabber = ETH_JABBER_ENABLE;
    ETH_InitParaStruct->ETH_MAC_InterFrameGap = ETH_INTERFRAMEGAP_96BIT;
    ETH_InitParaStruct->ETH_MAC_CarrierSense = ETH_CARRIERSENSE_ENABLE;
    ETH_InitParaStruct->ETH_MAC_Speed = ETH_SPEEDMODE_10M;
    ETH_InitParaStruct->ETH_MAC_ReceiveOwn = ETH_RECEIVEOWN_ENABLE;
    ETH_InitParaStruct->ETH_MAC_LoopbackMode = ETH_LOOPBACKMODE_DISABLE;
    ETH_InitParaStruct->ETH_MAC_Mode = ETH_MODE_HALFDUPLEX;
    ETH_InitParaStruct->ETH_MAC_ChecksumOffload = ETH_CHECKSUMOFFLOAD_DISABLE;
    ETH_InitParaStruct->ETH_MAC_RetryTransmission = ETH_RETRYTRANSMISSION_ENABLE;
    ETH_InitParaStruct->ETH_MAC_AutomaticPadCRCDrop = ETH_AUTOMATICPADCRCDROP_DISABLE;
    ETH_InitParaStruct->ETH_MAC_BackOffLimit = ETH_BACKOFFLIMIT_10;
    ETH_InitParaStruct->ETH_MAC_DeferralCheck = ETH_DEFERRALCHECK_DISABLE;
    ETH_InitParaStruct->ETH_MAC_FilterDisable = ETH_FILTERDISABLE_DISABLE;
    ETH_InitParaStruct->ETH_MAC_SourceAddrFilter = ETH_SOURCEADDRFILTER_DISABLE;
    ETH_InitParaStruct->ETH_MAC_PassControlFrames = ETH_PASSCONTROLFRAMES_BLOCKALL;
    ETH_InitParaStruct->ETH_MAC_BroadcastFramesReception = ETH_BROADCASTFRAMESRECEPTION_DISABLE;
    ETH_InitParaStruct->ETH_MAC_DestinationAddrFilter = ETH_DESTINATIONADDRFILTER_NORMAL;
    ETH_InitParaStruct->ETH_MAC_PromiscuousMode = ETH_PROMISCUOUSMODE_DISABLE;
    ETH_InitParaStruct->ETH_MAC_MulticastFramesFilter = ETH_MULTICASTFRAMESFILTER_PERFECT;
    ETH_InitParaStruct->ETH_MAC_UnicastFramesFilter = ETH_UNICASTFRAMESFILTER_PERFECT;
    ETH_InitParaStruct->ETH_MAC_HashListHigh = 0x0;
    ETH_InitParaStruct->ETH_MAC_HashListLow = 0x0;
    ETH_InitParaStruct->ETH_MAC_PauseTime = 0x0;
    ETH_InitParaStruct->ETH_MAC_ZeroQuantaPause = ETH_ZEROQUANTAPAUSE_DISABLE;
    ETH_InitParaStruct->ETH_MAC_PauseLowThreshold = ETH_PAUSELOWTHRESHOLD_MINUS4;
    ETH_InitParaStruct->ETH_MAC_FlowControlDeactiveThreshold = ETH_RFD_512BYTES;
    ETH_InitParaStruct->ETH_MAC_FlowControlActiveThreshold =  ETH_RFA_1536BYTES;
    ETH_InitParaStruct->ETH_MAC_UnicastPauseFrameDetect = ETH_UNICASTPAUSEFRAMEDETECT_DISABLE;
    ETH_InitParaStruct->ETH_MAC_ReceiveFlowControl = ETH_RECEIVEFLOWCONTROL_DISABLE;
    ETH_InitParaStruct->ETH_MAC_TransmitFlowControl = ETH_TRANSMITFLOWCONTROL_DISABLE;
    ETH_InitParaStruct->ETH_MAC_VLANTagComparison = ETH_VLANTAGCOMPARISON_16BIT;
    ETH_InitParaStruct->ETH_MAC_VLANTagIdentifier = 0x0;
    /* DMA */
    ETH_InitParaStruct->ETH_DMA_DropTCPIPChecksumErrorFrame = ETH_DROPTCPIPCHECKSUMERRORFRAME_DISABLE;
    ETH_InitParaStruct->ETH_DMA_ReceiveStoreForward = ETH_RECEIVESTOREFORWARD_ENABLE;
    ETH_InitParaStruct->ETH_DMA_FlushReceivedFrame = ETH_FLUSHRECEIVEDFRAME_DISABLE;
    ETH_InitParaStruct->ETH_DMA_TransmitStoreForward = ETH_TRANSMITSTOREFORWARD_ENABLE;
    ETH_InitParaStruct->ETH_DMA_TransmitThresholdControl = ETH_TRANSMITTHRESHOLDCONTROL_64BYTES;
    ETH_InitParaStruct->ETH_DMA_ForwardErrorFrames = ETH_FORWARDERRORFRAMES_DISABLE;
    ETH_InitParaStruct->ETH_DMA_ForwardUndersizedGoodFrames = ETH_FORWARDUNDERSIZEDGOODFRAMES_DISABLE;
    ETH_InitParaStruct->ETH_DMA_ReceiveThresholdControl = ETH_RECEIVETHRESHOLDCONTROL_64BYTES;
    ETH_InitParaStruct->ETH_DMA_SecondFrameOperate = ETH_SECONDFRAMEOPERATE_DISABLE;
    ETH_InitParaStruct->ETH_DMA_AddressAligned = ETH_ADDRESSALIGNED_ENABLE;
    ETH_InitParaStruct->ETH_DMA_FixedBurst = ETH_FIXEDBURST_DISABLE;
    ETH_InitParaStruct->ETH_DMA_RxDMABurstLength = ETH_RXDMABURSTLENGTH_1BEAT;
    ETH_InitParaStruct->ETH_DMA_TxDMABurstLength = ETH_TXDMABURSTLENGTH_1BEAT;
    ETH_InitParaStruct->ETH_DMA_DescriptorSkipLength = 0x0;
    ETH_InitParaStruct->ETH_DMA_Arbitration = ETH_DMAARBITRATION_ROUNDROBIN_RXTX_1_1;
}

/**
  * @brief  Enable or disable the ETH's receive and transmit.
  * @param  NewValue: ENABLE or DISABLE.
  * @retval None
  */
void ETH_Enable(TypeState NewValue)
{
    /* Enable or Disable the ETH module */
    if (NewValue != DISABLE) {
        /* Enable MAC transmit */
        ETH_MACTransmission_Enable(ENABLE);
        /* Flush ETHERNET DMA Transmit FIFO */
        ETH_CleanTransmitFIFO();
        /* Enable MAC receive */
        ETH_MACReception_Enable(ENABLE);

