RT-Thread/rt-thread/bsp/gd32103c-eval/Libraries/GD32F1xx_standard_peripheral/Source/gd32f10x_eth.c
/* PHY */
/**
  * @brief Get PHY of ETHERNET parameters.
  * @param PHYAddr: PHY device address, devices number max is 32.
  * @param PHYReg: PHY register address, register address max is 32.
  *   Select one of the follwing values :
  *     @arg PHY_BCR: Tranceiver Basic Control Register
  *     @arg PHY_BSR: Tranceiver Basic Status Register
  *     @arg PHY_SR : Tranceiver Status Register
  *     @arg More PHY register could be read depending on the used PHY
  * @retval value read from the selected PHY register (if timeout return ERROR)
  */
uint16_t ETH_GetPHYRegisterValue(uint16_t PHYAddr, uint16_t PHYReg)
{
    uint32_t temp = 0;
    __IO uint32_t timeout = 0;

    /* Get the ETHERNET MAC_PHYAR value */
    temp = ETH_MAC->PHYAR;
    temp &= ~MAC_PHYAR_CLR_MASK;
    /* Configuration the PHY address register value */
    /* Set the PHY device address */
    temp |= (((uint32_t)PHYAddr << MAC_PHYAR_PHYADDRSHIFT) & ETH_MAC_PHYAR_PA);
    /* Set the PHY register address */
    temp |= (((uint32_t)PHYReg << MAC_PHYAR_PHYREGSHIFT) & ETH_MAC_PHYAR_PR);
    /* Set the read mode */
    temp &= ~ETH_MAC_PHYAR_PW;
    /* Set the PHY Busy bit */
    temp |= ETH_MAC_PHYAR_PB;
    ETH_MAC->PHYAR = temp;
    /* Check the PHY Busy flag status */
    do {
        timeout++;
        temp = ETH_MAC->PHYAR;
    } while ((temp & ETH_MAC_PHYAR_PB) && (timeout < (uint32_t)PHY_READ_TO));
    /* Return ERROR due to timeout */
    if (timeout == PHY_READ_TO) {
        return (uint16_t)ERROR;
    }

    /* Return PHY register selected value */
    return (uint16_t)(ETH_MAC->PHYDR);
}

/**
  * @brief Set PHY of ETHERNET parameters.
  * @param PHYAddr: PHY device address, devices number max is 32.
  * @param PHYReg: PHY register address, register address max is 32.
  *   Select one of the follwing values :
  *     @arg PHY_BCR    : Tranceiver Control Register
  *     @arg More PHY register could be written depending on the used PHY
  * @param  PHYValue: write to register value
  * @retval The Write to the selected PHY register result(ERROR or SUCCESS)
  */
uint32_t ETH_SetPHYRegisterValue(uint16_t PHYAddr, uint16_t PHYReg, uint16_t PHYValue)
{
    uint32_t temp = 0;
    __IO uint32_t timeout = 0;

    /* Get the ETHERNET MAC_PHYAR value */
    temp = ETH_MAC->PHYAR;
    temp &= ~MAC_PHYAR_CLR_MASK;
    /* Configuration the PHY register address value */
    /* Set the PHY device address */
    temp |= (((uint32_t)PHYAddr << MAC_PHYAR_PHYADDRSHIFT) & ETH_MAC_PHYAR_PA);
    /* Set the PHY register address */
    temp |= (((uint32_t)PHYReg << MAC_PHYAR_PHYREGSHIFT) & ETH_MAC_PHYAR_PR);
    /* Set the write mode */
    temp |= ETH_MAC_PHYAR_PW;
    /* Set the PHY Busy bit */
    temp |= ETH_MAC_PHYAR_PB;
    /* Set the PHY selected register value */
    ETH_MAC->PHYDR = PHYValue;
    ETH_MAC->PHYAR = temp;
    /* Check the PHY Busy flag status */
    do {
        timeout++;
        temp = ETH_MAC->PHYAR;
    } while ((temp & ETH_MAC_PHYAR_PB) && (timeout < (uint32_t)PHY_WRITE_TO));
    /* Return ERROR due to timeout */
    if (timeout == PHY_WRITE_TO) {
        return ERROR;
    }

    return SUCCESS;
}

/**
  * @brief  Enable or disable the PHY loopBack function by write PHY register.
  * @param  PHYAddr: PHY device address, devices number max is 32.
  * @param  NewValue: new value of the PHY loopBack mode.
  *   This parameter can be: ENABLE or DISABLE.
  * @retval The Set PHYLoopBack mode result(ERROR or SUCCESS)
  */
uint32_t ETH_PHYLoopBack_Enable(uint16_t PHYAddr, TypeState NewValue)
{
    uint16_t temp = 0;

    /* Get the PHY BCR register value */
    temp = ETH_GetPHYRegisterValue(PHYAddr, PHY_BCR);

    if (NewValue != DISABLE) {
        /* Enable the PHY loopback mode */
        temp |= PHY_LOOPBACK;
    } else {
        /* Disable the PHY loopback mode (change to normal mode) */
        temp &= (uint16_t)(~(uint16_t)PHY_LOOPBACK);
    }
    /* Set the PHY BCR register with the new value */
    if (ETH_SetPHYRegisterValue(PHYAddr, PHY_BCR, temp) != (uint32_t)RESET) {
        return SUCCESS;
    } else {
        return ERROR;
    }
}

/* MAC */
/**
  * @brief  Enable or disable the MAC transmit function.
  * @param  NewValue: new value of the MAC transmit function.
  *   This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void ETH_MACTransmission_Enable(TypeState NewValue)
{
    if (NewValue != DISABLE) {
        /* Enable the MAC transmission */
        ETH_MAC->CFR |= ETH_MAC_CFR_TEN;
    } else {
        /* Disable the MAC transmission */
        ETH_MAC->CFR &= ~ETH_MAC_CFR_TEN;
    }
}

/**
  * @brief  Enable or disable the MAC receive function.
  * @param  NewValue: new value of the MAC reception.
  *   This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void ETH_MACReception_Enable(TypeState NewValue)
{
    if (NewValue != DISABLE) {
        /* Enable the MAC reception */
        ETH_MAC->CFR |= ETH_MAC_CFR_REN;
    } else {
        /* Disable the MAC reception */
        ETH_MAC->CFR &= ~ETH_MAC_CFR_REN;
    }
}

/**
  * @brief  Get the bit flag of the ETHERNET flow control busy status.
  * @param  None
  * @retval current flow control busy bit status
  */
TypeState ETH_GetFlowControlBusyBitState(void)
{
    /* Check the flow control busy bit status */
    if ((ETH_MAC->FCTLR & ETH_MAC_FCTLR_FLCBBKPA) != (uint32_t)RESET) {
        return SET;
    } else {
        return RESET;
    }
}

/**
  * @brief  Initiate a Pause Frame in Full-duplex mode only.
  * @param  None
  * @retval None
  */
void ETH_PauseFrameInit(void)
{
    /* Initiate pause control frame in full duplex mode*/
    ETH_MAC->FCTLR |= ETH_MAC_FCTLR_FLCBBKPA;
}

/**
  * @brief  Enable or disable the BackPressure requests in Half-duplex only.
  * @param  NewValue: new value of the BackPressure operation requests.
  *   This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void ETH_BackPressureActivation_Enable(TypeState NewValue)
{
    if (NewValue != DISABLE) {
        /* Enable the BackPressure requests */
        ETH_MAC->FCTLR |= ETH_MAC_FCTLR_FLCBBKPA;
    } else {
        /* Disable the BackPressure requests */
        ETH_MAC->FCTLR &= ~ETH_MAC_FCTLR_FLCBBKPA;
    }
}

/**
  * @brief  Get the status flag of ETH_MAC_ISR register.
  * @param  ETH_MAC_FLAG: the status flag of ETH_MAC_ISR register.
  *   Select one of the follwing values :
  *     @arg ETH_MAC_FLAG_TST  : Time stamp trigger flag
  *     @arg ETH_MAC_FLAG_MSCT : MSC transmit flag
  *     @arg ETH_MAC_FLAG_MSCR : MSC receive flag
  *     @arg ETH_MAC_FLAG_MSC  : MSC flag
  *     @arg ETH_MAC_FLAG_WUM  : WUM flag
  * @retval The current MAC bit selected status(SET or RESET).
  */
TypeState ETH_GetMACBitState(uint32_t ETH_MAC_FLAG)
{
    /* Check the ETH_MAC_FLAG status */
    if ((ETH_MAC->ISR & ETH_MAC_FLAG) != (uint32_t)RESET) {
        return SET;
    } else {
        return RESET;
    }
}

/**
  * @brief  Get the interrupt flag of ETH_MAC_ISR register.
  * @param  ETH_MAC_INT: the interrupt flag of ETH_MAC_ISR register.
  *   Select one of the follwing values :
  *     @arg ETH_MAC_INT_TST  : Time stamp trigger interrupt
  *     @arg ETH_MAC_INT_MSCT : MSC transmit interrupt
  *     @arg ETH_MAC_INT_MSCR : MSC receive interrupt
  *     @arg ETH_MAC_INT_MSC  : MSC interrupt
  *     @arg ETH_MAC_INT_WUM  : WUM interrupt
  * @retval The current MAC interrupt bit selected status(SET or RESET).
  */
TypeState ETH_GetMACIntBitState(uint32_t ETH_MAC_INT)
{
    /* Check the ETH_MAC_INT status */
    if ((ETH_MAC->ISR & ETH_MAC_INT) != (uint32_t)RESET) {
        return SET;
    } else {
        return RESET;
    }
}

/**
  * @brief  Enable or disable the ETH_MAC_INT control bit.
  * @param  ETH_MAC_INT: the interrupt bit flag.
  *   Select one of the follwing values :
  *     @arg ETH_MAC_INT_TST : Time stamp trigger interrupt
  *     @arg ETH_MAC_INT_WUM : WUM interrupt
  * @param  NewValue: new value of the ETH_MAC_INT value.
  *   This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void ETH_MACINTConfig(uint32_t ETH_MAC_INT, TypeState NewValue)
{
    if (NewValue != DISABLE) {
        /* Enable the MAC interrupt */
        ETH_MAC->IMR &= (~(uint32_t)ETH_MAC_INT);
    } else {
        /* Disable the MAC interrupt */
        ETH_MAC->IMR |= ETH_MAC_INT;
    }
}

/**
  * @brief  Set the MAC address to MAC address register selected.
  * @param  addr: The MAC address register to selected.
  *  Select one of the follwing values :
  *     @arg ETH_MAC_ADDRESS0 : MAC Address0
  *     @arg ETH_MAC_ADDRESS1 : MAC Address1
  *     @arg ETH_MAC_ADDRESS2 : MAC Address2
  *     @arg ETH_MAC_ADDRESS3 : MAC Address3
  * @param buf: Pointer to application MAC address buffer(6 bytes).
  * @retval None
  */
void ETH_SetMACAddress(uint32_t addr, uint8_t *buf)
{
    uint32_t temp;

    temp = ((uint32_t)buf[5] << 8) | (uint32_t)buf[4];
    /* Set the selectecd MAC address high register */
    (*(__IO uint32_t *)(ETH_MAC_ADDR_HBASE + addr)) = temp;
    temp = ((uint32_t)buf[3] << 24) | ((uint32_t)buf[2] << 16) | ((uint32_t)buf[1] << 8) | buf[0];

    /* Set the selectecd MAC address low register */
    (*(__IO uint32_t *)(ETH_MAC_ADDR_LBASE + addr)) = temp;
}

/**
  * @brief  Get the MAC address from MAC address register selected.
  * @param  addr: The MAC addres to selected.
  *   Select one of the follwing values :
  *     @arg ETH_MAC_ADDRESS0 : MAC Address0
  *     @arg ETH_MAC_ADDRESS1 : MAC Address1
  *     @arg ETH_MAC_ADDRESS2 : MAC Address2
  *     @arg ETH_MAC_ADDRESS3 : MAC Address3
  * @param  buf: Pointer to application MAC address buffer(6 bytes).
  * @retval None
  */
void ETH_GetMACAddress(uint32_t addr, uint8_t *buf)
{
    uint32_t temp;

