RT-Thread/rt-thread/bsp/gd32103c-eval/Libraries/GD32F1xx_standard_peripheral/Source/gd32f10x_eth.c
    /* Configuration ETH_MAC_RWFFR register */
    for (num = 0; num < ETH_WAKEUP_REGISTER_LENGTH; num++) {
        ETH_MAC->RWFFR = pBuffer[num];
    }
}

/**
  * @brief  Enable or disable ETH_MAC_WUMR_GU control bit.
  * @param  NewValue: new value of the MAC Global Unicast Wake-Up.
  *   This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void ETH_GlobalUnicastWakeUp_Enable(TypeState NewValue)
{
    if (NewValue != DISABLE) {
        /* Enable the ETH_MAC_WUMR_GU control bit */
        ETH_MAC->WUMR |= ETH_MAC_WUMR_GU;
    } else {
        /* Disable the ETH_MAC_WUMR_GU control bit */
        ETH_MAC->WUMR &= ~ETH_MAC_WUMR_GU;
    }
}

/**
  * @brief  Get the bit flag of the WUM.
  * @param  ETH_WUM_FLAG: the flag of ETH_MAC_WUMR register.
  *   Select one of the follwing values :
  *     @arg ETH_WUM_FLAG_WUFFRPR : Wake-Up Frame Filter Register Poniter Reset
  *     @arg ETH_WUM_FLAG_WUFR    : Wake-Up Frame Received
  *     @arg ETH_WUM_FLAG_MPKR    : Magic Packet Received
  * @retval The current ETHERNET WUM Flag selected bit status(SET or RESET).
  */
TypeState ETH_GetWUMBitState(uint32_t ETH_WUM_FLAG)
{
    if ((ETH_MAC->WUMR & ETH_WUM_FLAG) != (uint32_t)RESET) {
        /* WUM Flag is set */
        return SET;
    } else {
        /* WUM Flag is reset */
        return RESET;
    }
}

/**
  * @brief  Enable or disable the ETH_MAC_WUMR_WFEN control bit.
  * @param  NewValue: new value of the ETH_MAC_WUMR_WFEN bit.
  *   This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void ETH_WakeUpFrameDetection_Enable(TypeState NewValue)
{
    if (NewValue != DISABLE) {
        /* Active the MAC Wake-Up Frame Detection */
        ETH_MAC->WUMR |= ETH_MAC_WUMR_WFEN;
    } else {
        /* Deactive the MAC Wake-Up Frame Detection */
        ETH_MAC->WUMR &= ~ETH_MAC_WUMR_WFEN;
    }
}

/**
  * @brief  Enable or disable the ETH_MAC_WUMR_MPEN control bit.
  * @param  NewValue: new value of the ETH_MAC_WUMR_MPEN bit.
  *   This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void ETH_MagicPacketDetection_Enable(TypeState NewValue)
{
    if (NewValue != DISABLE) {
        /* Enable the ETH_MAC_WUMR_MPEN control bit */
        ETH_MAC->WUMR |= ETH_MAC_WUMR_MPEN;
    } else {
        /* Disable the ETH_MAC_WUMR_MPEN control bit */
        ETH_MAC->WUMR &= ~ETH_MAC_WUMR_MPEN;
    }
}

/**
  * @brief  Enable or disable the ETH_MAC_WUMR_PWD control bit.
  * @param  NewValue: new value of the ETH_MAC_WUMR_PWD bit.
  *   This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void ETH_PowerDown_Enable(TypeState NewValue)
{
    if (NewValue != DISABLE) {
        /* Enable the ETH_MAC_WUMR_PWD control bit */
        ETH_MAC->WUMR |= ETH_MAC_WUMR_PWD;
    } else {
        /* Disable the ETH_MAC_WUMR_PWD control bit */
        ETH_MAC->WUMR &= ~ETH_MAC_WUMR_PWD;
    }
}

/* MSC */
/**
  * @brief  Enable or disable the ETH_MSC_CTLR_MCFZ control bit.
  * @param  NewValue: new value of the MSC Counter Freeze.
  *   This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void ETH_MSCCounterFreeze_Enable(TypeState NewValue)
{
    if (NewValue != DISABLE) {
        /* Enable the ETH_MSC_CTLR_MCFZ control bit */
        ETH_MSC->CTLR |= ETH_MSC_CTLR_MCFZ;
    } else {
        /* Disable the ETH_MSC_CTLR_MCFZ control bit */
        ETH_MSC->CTLR &= ~ETH_MSC_CTLR_MCFZ;
    }
}

/**
  * @brief  Enable or disable the ETH_MSC_CTLR_RTOR control bit.
  * @param  NewValue: new value of the MSC Reset On Read.
  *   This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void ETH_MSCResetOnRead_Enable(TypeState NewValue)
{
    if (NewValue != DISABLE) {
        /* Enable the ETH_MSC_CTLR_RTOR control bit */
        ETH_MSC->CTLR |= ETH_MSC_CTLR_RTOR;
    } else {
        /* Disable the ETH_MSC_CTLR_RTOR control bit */
        ETH_MSC->CTLR &= ~ETH_MSC_CTLR_RTOR;
    }
}

/**
  * @brief  Enable or disable the ETH_MSC_CTLR_CTSR control bit.
  * @param  NewValue: new value of the ETH_MSC_CTLR_CTSR bit.
  *   This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void ETH_MSCCounterRollover_Enable(TypeState NewValue)
{
    if (NewValue != DISABLE) {
        /* Enable the ETH_MSC_CTLR_CTSR control bit */
        ETH_MSC->CTLR &= ~ETH_MSC_CTLR_CTSR;
    } else {
        /* Disable the ETH_MSC_CTLR_CTSR control bit */
        ETH_MSC->CTLR |= ETH_MSC_CTLR_CTSR;
    }
}

/**
  * @brief  Resets the MSC Counters.
  * @param  None
  * @retval None
  */
void ETH_MSCCountersReset(void)
{
    ETH_MSC->CTLR |= ETH_MSC_CTLR_CTR;
}

/**
  * @brief  Enable or disable the ETH_MSC_INT control bit.
  * @param  ETH_MSC_INT: the MSC interrupt sources flag of MSC_RIMR and MSC_TIMR.
  *   This parameter can be any combination of Tx interrupt or
  *   any combination of Rx interrupt (but not both)of the following values:
  *     @arg ETH_MSC_INT_TGF   : When Tx good frame counter reaches half the maximum value
  *     @arg ETH_MSC_INT_TGFMSC: When Tx good multi col counter reaches half the maximum value
  *     @arg ETH_MSC_INT_TGFSC : When Tx good single col counter reaches half the maximum value
  *     @arg ETH_MSC_INT_RGUF  : When Rx good unicast frames counter reaches half the maximum value
  *     @arg ETH_MSC_INT_RFAE  : When Rx alignment error counter reaches half the maximum value
  *     @arg ETH_MSC_INT_RFCE  : When Rx crc error counter reaches half the maximum value
  * @param  NewValue: new value of the MSC interrupt sources flag of MSC_RIMR and MSC_TIMR.
  *   This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void ETH_MSCINTConfig(uint32_t ETH_MSC_INT, TypeState NewValue)
{
    if ((ETH_MSC_INT & (uint32_t)0x10000000) != (uint32_t)RESET) {
        /* Get MSC interrupts souce bit position */
        ETH_MSC_INT &= 0xEFFFFFFF;

        /* MSC Rx interrupts souce bit selected */
        if (NewValue != DISABLE) {
            /* Enable the Rx ETH_MSC_INT control bit */
            ETH_MSC->RIMR &= (~(uint32_t)ETH_MSC_INT);
        } else {
            /* Disable the Rx ETH_MSC_INT control bit */
            ETH_MSC->RIMR |= ETH_MSC_INT;
        }
    } else {
        /* MSC Tx interrupts souce bit selected */
        if (NewValue != DISABLE) {
            /* Enable the Tx ETH_MSC_INT control bit */
            ETH_MSC->TIMR &= (~(uint32_t)ETH_MSC_INT);
        } else {
            /* Disable the Tx ETH_MSC_INT control bit */
            ETH_MSC->TIMR |= ETH_MSC_INT;
        }
    }
}

/**
  * @brief  Get the bit flag of MSC INT.
  * @param  ETH_MSC_INT: the MSC interrupt flag of ETH_MSC_RISR and ETH_MSC_TISR.
  *   Select one of the follwing values :
  *     @arg ETH_MSC_INT_TGF: When Tx good frame counter reaches half the maximum value
  *     @arg ETH_MSC_INT_TGFMSC: When Tx good multi col counter reaches half the maximum value
  *     @arg ETH_MSC_INT_TGFSC: When Tx good single col counter reaches half the maximum value
  *     @arg ETH_MSC_INT_RGUF: When Rx good unicast frames counter reaches half the maximum value
  *     @arg ETH_MSC_INT_RFAE : When Rx alignment error counter reaches half the maximum value
  *     @arg ETH_MSC_INT_RFCE : When Rx crc error counter reaches half the maximum value
  * @retval The current ETHERNET MSC IT selected bit status(SET or RESET).
  */
TypeState ETH_GetMSCINTStatus(uint32_t ETH_MSC_INT)
{
    if ((ETH_MSC_INT & (uint32_t)0x10000000) != (uint32_t)RESET) {
        /* Check if the MSC interrupt flag of ETH_MSC_RISR selected is enabled and occured */
        if ((((ETH_MSC->RISR & ETH_MSC_INT) != (uint32_t)RESET)) && ((ETH_MSC->RIMR & ETH_MSC_INT) != (uint32_t)RESET)) {
            /* The MSC interrupt flag of ETH_MSC_RISR is set */
            return SET;
        } else {
            /* The MSC interrupt flag of ETH_MSC_RISR is reset */
            return RESET;
        }
    } else {
        /* Check if the MSC interrupt flag of ETH_MSC_TISR selected is enabled and occured */
        if ((((ETH_MSC->TISR & ETH_MSC_INT) != (uint32_t)RESET)) && ((ETH_MSC->RIMR & ETH_MSC_INT) != (uint32_t)RESET)) {
            /* The MSC interrupt flag of ETH_MSC_TISR is set */
            return SET;
        } else {
            /* The MSC interrupt flag of ETH_MSC_TISR is reset */
            return RESET;
        }
    }
}

/**
  * @brief  Read value of the MSC module register.
  * @param  ETH_MSC_Register: the MSC module register selected.
  *   Select one of the follwing values :
  *     @arg ETH_MSC_CTLR     : MSC CR register
  *     @arg ETH_MSC_RISR     : MSC RIR register
  *     @arg ETH_MSC_TISR     : MSC TIR register
  *     @arg ETH_MSC_RIMR     : MSC RIMR register
  *     @arg ETH_MSC_TIMR     : MSC TIMR register
  *     @arg ETH_MSC_SCCNT    : MSC TGFSCCR register
  *     @arg ETH_MSC_MSCCNT   : MSC TGFMSCCR register
  *     @arg ETH_MSC_TGFCNT   : MSC TGFCR register
  *     @arg ETH_MSC_RFCECNT  : MSC RFCECR register
  *     @arg ETH_MSC_RFAECNT  : MSC RFAECR register
  *     @arg ETH_MSC_RGUFCNT  : MSC RGUFCRregister
  * @retval MSC module Register selected value.
  */
uint32_t ETH_GetMSCRegister(uint32_t ETH_MSC_Register)
{
    /* Return the value of MSC module Register selected  */
    return (*(__IO uint32_t *)(ETH_MAC_BASE + ETH_MSC_Register));
}

/* PTP */
/**
  * @brief  Updated the Time Stamp Addend register value to the PTP block(used only when the system time is configured
  *   for Fine update mode).
  * @param  None
  * @retval None
  */
void ETH_PTPTimeStampAddendUpdate(void)
{
    ETH_PTP->TSCTLR |= ETH_PTP_TSCTLR_TMSARU;
}

/**
  * @brief  Set ETH_PTP_TSCTLR_TMSITEN bit.
  * @param  NewValue: new value of the MAC reception.
  *   This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void ETH_PTPTimeStampIntTrigger_Enable(TypeState NewValue)
{
    if (NewValue != DISABLE) {
        /* Enable ETH_PTP_TSCTLR_TMSITEN bit */
        ETH_PTP->TSCTLR |= ETH_PTP_TSCTLR_TMSITEN;
    } else {
        /* Disable ETH_PTP_TSCTLR_TMSITEN bit */
        ETH_PTP->TSCTLR &= ~ETH_PTP_TSCTLR_TMSITEN;
    }
}

/**
  * @brief  Updated the Time Stamp Update register value to the PTP system time.
  * @param  NewValue: new value of the MAC reception.
  *   This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void ETH_PTPTimeStampUpdate_Enable(TypeState NewValue)
{
    if (NewValue != DISABLE) {
        /* Enable PTP time stamp update */
        ETH_PTP->TSCTLR |= ETH_PTP_TSCTLR_TMSSTU;
    } else {
        /* Disable PTP time stamp update */
        ETH_PTP->TSCTLR &= ~ETH_PTP_TSCTLR_TMSSTU;
    }
}

/**
  * @brief  Initialize the PTP Time Stamp mode
  * @param  None
  * @retval None
  */
void ETH_PTPTimeStampInit(void)
{
    ETH_PTP->TSCTLR |= ETH_PTP_TSCTLR_TMSSTI;
}

/**
  * @brief  Set the PTP Time Stamp Update mode
  * @param  UpdateMode: the PTP Update mode selected
  *   Select one of the follwing values :
  *     @arg ETH_PTP_FINEMODE   : Fine Update method
  *     @arg ETH_PTP_COARSEMODE : Coarse Update method
  * @retval None
  */
void ETH_PTPUpdateModeConfig(uint32_t UpdateMode)
{
    if (UpdateMode != ETH_PTP_COARSEMODE) {
        /* Enable the PTP Fine Update mode */
        ETH_PTP->TSCTLR |= ETH_PTP_TSCTLR_TMSFCU;
    } else {
        /* Disable the PTP Coarse Update mode */
        ETH_PTP->TSCTLR &= (~(uint32_t)ETH_PTP_TSCTLR_TMSFCU);
    }
}

/**
  * @brief  Enable or disable ETH_PTP_TSCTLR_TMSEN control bit.
  * @param  NewValue: new value of the  ETH_PTP_TSCTLR_TMSEN control bit
  *   This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void ETH_PTPTimeStamp_Enable(TypeState NewValue)
{
    if (NewValue != DISABLE) {
        /* Enable the ETH_PTP_TSCTLR_TMSEN control bit */
        ETH_PTP->TSCTLR |= ETH_PTP_TSCTLR_TMSEN;
    } else {
        /* Disable the ETH_PTP_TSCTLR_TMSEN control bit */
        ETH_PTP->TSCTLR &= (~(uint32_t)ETH_PTP_TSCTLR_TMSEN);
    }
}

/**
  * @brief  Get the bit flag of ETHERNET PTP.
  * @param  ETH_PTP_FLAG: the flag of PTP_TSCTLR register.
  *   Select one of the follwing values :
  *     @arg ETH_PTP_FLAG_TMSARU  : Addend Register Update
  *     @arg ETH_PTP_FLAG_TMSITEN : Time Stamp Interrupt Trigger Enable
  *     @arg ETH_PTP_FLAG_TMSSTU  : Time Stamp Update
  *     @arg ETH_PTP_FLAG_TMSSTI  : Time Stamp Initialize
  * @retval The current ETHERNET PTP Flag selected bit status(SET or RESET).
  */
TypeState ETH_GetPTPBitState(uint32_t ETH_PTP_FLAG)
{
    if ((ETH_PTP->TSCTLR & ETH_PTP_FLAG) != (uint32_t)RESET) {
        /* ETH_PTP_FLAG is set */
        return SET;
    } else {
        /* ETH_PTP_FLAG is reset */
        return RESET;
    }
}

/**
  * @brief  Set Each HCLK cycle the system time Sub-Second Increased value.
  * @param  SubSecond: the PTP_SSINCR Register value.
  * @retval None
  */
void ETH_SetPTPSubSecondIncrement(uint32_t SubSecond)
{
    ETH_PTP->SSINCR = SubSecond;
}

/**
  * @brief  Set the system time update sign and values.
  * @param  Sign: the PTP Time update value sign(positive or negative).
  *   Select one of the follwing values :
  *     @arg ETH_PTP_POSITIVETIME : positive time value.
  *     @arg ETH_PTP_NEGATIVETIME : negative time value.
  * @param  Second: the PTP Time update value in second part.
  * @param  SubSecond: the PTP Time update value in sub-second part.
  *   This parameter is a 31 bit value, bit32 correspond to the sign.
  * @retval None
  */
void ETH_SetPTPUpdateTimeValue(uint32_t Sign, uint32_t SecondValue, uint32_t SubSecondValue)
{
    /* Set the PTP Time Update High Register with second value*/
    ETH_PTP->TMSHUR = SecondValue;

