RT-Thread/rt-thread/bsp/gd32103c-eval/Libraries/GD32F1xx_standard_peripheral/Source/gd32f10x_eth.c
    if ((DMACurrentTxDesc->Status & ETH_DMATXDESC_BUSY) != (uint32_t)RESET) {
        /* Return ERROR: the descriptor is busy due to own by the DMA */
        return ERROR;
    }
    for (offset = 0; offset < size; offset++) {
        (*(__IO uint8_t *)((DMACurrentPTPTxDesc->Buffer1Addr) + offset)) = (*(pbuf + offset));
    }
    /* Setting the Frame Length */
    DMACurrentTxDesc->ControlBufferSize = (size & (uint32_t)0x1FFF);
    /* Setting the segment of frame (ETH_DMATXDESC_LSG and ETH_DMATXDESC_FSG are SET that frame is transmitted in one descriptor) */
    DMACurrentTxDesc->Status |= ETH_DMATXDESC_LSG | ETH_DMATXDESC_FSG;
    /* Enable the DMA transmission */
    DMACurrentTxDesc->Status |= ETH_DMATXDESC_BUSY;
    /* Check Tx Buffer unavailable flag status */
    if ((ETH_DMA->STR & ETH_DMA_STR_TBU) != (uint32_t)RESET) {
        /* Clear TBU ETHERNET DMA flag */
        ETH_DMA->STR = ETH_DMA_STR_TBU;
        /* Resume DMA transmission by writing to the TPER register*/
        ETH_DMA->TPER = 0;
    }
    /* Wait for ETH_DMATXDESC_TTMSS flag to be set unless timeout */
    do {
        timeout++;
    } while (!(DMACurrentTxDesc->Status & ETH_DMATXDESC_TTMSS) && (timeout < 0xFFFF));
    /* Return ERROR due to timeout */
    if (timeout == PHY_READ_TO) {
        return ERROR;
    }
    /* Clear the DMACurrentTxDesc status register TTSS flag */
    DMACurrentTxDesc->Status &= ~ETH_DMATXDESC_TTMSS;
    *PTPTxTab++ = DMACurrentTxDesc->Buffer1Addr;
    *PTPTxTab = DMACurrentTxDesc->Buffer2NextDescAddr;
    /* Update the ETHERNET DMA current Tx descriptor pointer to the next Tx decriptor in DMA Tx decriptor talbe*/
    /* Chained Mode */
    if ((DMACurrentTxDesc->Status & ETH_DMATXDESC_TCHM) != (uint32_t)RESET) {
        DMACurrentTxDesc = (ETH_DMADESCTypeDef *)(DMACurrentPTPTxDesc->Buffer2NextDescAddr);
        if (DMACurrentPTPTxDesc->Status != 0) {
            DMACurrentPTPTxDesc = (ETH_DMADESCTypeDef *)(DMACurrentPTPTxDesc->Status);
        } else {
            DMACurrentPTPTxDesc++;
        }
    }
    /* Ring Mode */
    else {
        if ((DMACurrentTxDesc->Status & ETH_DMATXDESC_TERM) != (uint32_t)RESET) {
            DMACurrentTxDesc = (ETH_DMADESCTypeDef *)(ETH_DMA->TDTAR);
            DMACurrentPTPTxDesc = (ETH_DMADESCTypeDef *)(ETH_DMA->TDTAR);
        } else {
            DMACurrentTxDesc = (ETH_DMADESCTypeDef *)((uint32_t)DMACurrentTxDesc + ETH_DMATXDESC_SIZE + ((ETH_DMA->BCR & ETH_DMA_BCR_DPSL) >> 2));
            DMACurrentPTPTxDesc = (ETH_DMADESCTypeDef *)((uint32_t)DMACurrentPTPTxDesc + ETH_DMATXDESC_SIZE + ((ETH_DMA->BCR & ETH_DMA_BCR_DPSL) >> 2));
        }
    }
    return SUCCESS;
}

/**
  * @brief  Receive a packet data with Time Stamp values to application buffer.
  * @param  pbuf: Pointer on the application buffer.
  * @param  PTPRxTab: Pointer to the first PTP Rx table to store Time stamp values.
  * @retval The Receive frame length with PTP(If size is equal to ERROR, the receiving unsuccessful)
  */
uint32_t ETH_HandlePTPRxPkt(uint8_t *pbuf, uint32_t *PTPRxTab)
{
    uint32_t offset = 0, size = 0;

    if ((DMACurrentRxDesc->Status & ETH_DMARXDESC_BUSY) != (uint32_t)RESET) {
        /* Return ERROR: the descriptor is busy due to own by the DMA */
        return ERROR;
    }
    if (((DMACurrentRxDesc->Status & ETH_DMARXDESC_ERRS) == (uint32_t)RESET) &&
            ((DMACurrentRxDesc->Status & ETH_DMARXDESC_LDES) != (uint32_t)RESET) &&
            ((DMACurrentRxDesc->Status & ETH_DMARXDESC_FDES) != (uint32_t)RESET)) {
        /* Get the Frame Length exclusive CRC */
        size = ((DMACurrentRxDesc->Status & ETH_DMARXDESC_FRML) >> ETH_DMARXDESC_FRAME_LENGTHSHIFT) - 4;
        for (offset = 0; offset < size; offset++) {
            (*(pbuf + offset)) = (*(__IO uint8_t *)((DMACurrentPTPRxDesc->Buffer1Addr) + offset));
        }
    } else {
        /* Return ERROR */
        size = ERROR;
    }
    /* Check Rx Buffer unavailable flag status */
    if ((ETH_DMA->STR & ETH_DMA_STR_RBU) != (uint32_t)RESET) {
        /* Clear RBU ETHERNET DMA flag */
        ETH_DMA->STR = ETH_DMA_STR_RBU;
        /* Resume DMA reception by writing to the RPER register*/
        ETH_DMA->RPER = 0;
    }
    *PTPRxTab++ = DMACurrentRxDesc->Buffer1Addr;
    *PTPRxTab = DMACurrentRxDesc->Buffer2NextDescAddr;
    /* Enable reception */
    DMACurrentRxDesc->Status |= ETH_DMARXDESC_BUSY;
    /* Update the ETHERNET DMA current Rx descriptor pointer to the next Rx decriptor in DMA Rx decriptor talbe*/
    /* Chained Mode */
    if ((DMACurrentRxDesc->ControlBufferSize & ETH_DMARXDESC_RCHM) != (uint32_t)RESET) {
        DMACurrentRxDesc = (ETH_DMADESCTypeDef *)(DMACurrentPTPRxDesc->Buffer2NextDescAddr);
        if (DMACurrentPTPRxDesc->Status != 0) {
            DMACurrentPTPRxDesc = (ETH_DMADESCTypeDef *)(DMACurrentPTPRxDesc->Status);
        } else {
            DMACurrentPTPRxDesc++;
        }
    }
    /* Ring Mode */
    else {
        if ((DMACurrentRxDesc->ControlBufferSize & ETH_DMARXDESC_RERR) != (uint32_t)RESET) {
            DMACurrentRxDesc = (ETH_DMADESCTypeDef *)(ETH_DMA->RDTAR);
        } else {
            DMACurrentRxDesc = (ETH_DMADESCTypeDef *)((uint32_t)DMACurrentRxDesc + ETH_DMARXDESC_SIZE + ((ETH_DMA->BCR & ETH_DMA_BCR_DPSL) >> 2));
        }
    }
    /* Return Frame size or ERROR */
    return (size);
}

#ifndef USE_Delay
/**
  * @brief  Insert a delay time.
  * @param  nCount: specifies the delay time length.
  * @retval None
  */
static void ETH_Delay(__IO uint32_t nCount)
{
    __IO uint32_t time = 0;

    for (time = nCount; time != 0; time--) {
    }
}
#endif /* USE_Delay */
#endif /* GD32F10X_CL */
/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

